testdata/openHFDIBRANS_kO/system/createPatchDictNewPatch
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// dummy file to clean zero-size patches via createPatch
pointSync false;

// Patches to create.
patches
(
	{
        // Name of new patch
        name wallInsideLambda;

        // Type of new patch
        patchInfo
        {
            type wall;
        }

        // How to construct: either from 'patches' or 'set'
        constructFrom set;

        // If constructFrom = set : name of faceSet
        set bFacesInsideLambda;
	}
);


// ************************************************************************* //

