testdata/openHFDIBRANS_kO/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          80000;
        startFace       79320;
    }
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       159320;
    }
    outlet
    {
        type            patch;
        nFaces          40;
        startFace       159360;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          400;
        startFace       159400;
    }
    wallInsideLambda
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          880;
        startFace       159800;
    }
)

// ************************************************************************* //
