testdata/openHFDIBRANS_kO/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  HFDIBRAS;

HFDIBRAS
{
    HFDIBRASModel       HFDIBKOmega;
    turbulence          on;
    printCoeffs         on;
    disGSurfaceType     setValue;
    disGBoundaryValue   1.0;
    kSurfaceType        setValue;
    kBoundaryValue      0.0;
    tolKEqn             1e-8;
}

// ************************************************************************* //
