testdata/openHFDIBRANS_kO/constant/HFDIBDEMDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      HFDIBDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceThreshold    1e-4;
sdBasedLambda       true;
interfaceSpan       1.0;
saveIntInfo         true;
scaleDisG           true;
scaleCoeff          1.0;

wallFunctions
{
    nut         nutkWallFunction;
    k           kLowReWallFunction;
    omega       omegaWallFunction;
    epsilon     epsilonWallFunction;
}

// ************************************************************************* //
