testdata/openHFDIBRANS_kO/0.org/f
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      f;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type        zeroGradient;
    }

    outlet
    {
        type        zeroGradient;
    }

    walls
    {
        type        zeroGradient;
    }

    wallInsideLambda
    {
        type        zeroGradient;
    }

    frontAndBack
    {
        type        empty;
    }
}

// ************************************************************************* //
