testdata/openHFDIBRANS_kO/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-10;
        relTol          0.0;

        // Smoother config
        smoother        FDIC;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;

        // Agglomeration config
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    pFinal
    {
        $p;
        tolerance       1e-12;
        relTol          0.0;
    }

    "(U|k|epsilon|omega|R|nuTilda)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-30;
        relTol          0.0;
    }
    "(U|k|epsilon|omega|R|nuTilda)Final"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-30;
        relTol          0.0;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent yes; //I changed this

    residualControl
    {
        p           1e-5;
    }

    HFDIB
    {
        U
        {
              surfaceType     setValue;
              boundaryValue   0.0;
              tolEqn          1e-8;
        }
    }
}

relaxationFactors
{
    fields
    {
        p           0.2;
        U           0.5;
        k           0.8;
        omega       0.8;
        epsilon     0.8;
    }

    equations
    {
        ".*" 0.85;
    }
}

cache
{
    grad(U);
}
// ************************************************************************* //
